[
  {
    "surah": 17,
    "ayahs": [
      57
    ],
    "occasions": [
      "عَنْ عَبْدِ الله بْنِ مَسْعُودٍ رضي الله عنه { أُو۟لَـٰٓئِكَ ٱلَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَىٰ رَبِّهِمُ ٱلْوَسِيلَةَ } قَالَ: نَزَلَتْ فِي نَفَرٍ مِنْ الْعَرَبِ كَانُوا يَعْبُدُونَ نَفَرَاً مِنْ الْجِنِّ، فَأَسْلَمَ الْجِنِّيُّونَ، وَالْإِنْسُ الَّذِينَ كَانُوا يَعْبُدُونَهُمْ لَا يَشْعُرُونَ، فَنَزَلَتْ { أُو۟لَـٰٓئِكَ ٱلَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَىٰ رَبِّهِمُ ٱلْوَسِيلَةَ }. واللفظ لمسلم."
    ]
  },
  {
    "surah": 17,
    "ayahs": [
      59
    ],
    "occasions": [
      "عَنِ ابْنِ عَبَّاسٍ رضي الله عنهما قَالَ: سَأَلَ أَهْلُ مَكَّةَ النَّبِيَّ ﷺ، أَنْ يَجْعَلَ لَهُمُ الصَّفَا ذَهَباً، وَأَنْ يُنَحِّيَ الْجِبَالَ عَنْهُمْ فَيَزْدَرِعُوا، فَقِيلَ لَهُ: إِنْ شِئْتَ أَنْ تَسْتَأْنِيَ بِهِمْ، وَإِنْ شِئْتَ أَنْ تُؤْتِيَهُمْ الَّذِي سَأَلُوا، فَإِنْ كَفَرُوا أُهْلِكُوا كَمَا أَهْلَكْتُ مَنْ قَبْلَهُمْ، قَالَ: « لَا بَلْ أَسْتَأْنِي بِهِمْ » فَأَنْزَلَ اللَّه عز و جل هَذِهِ الْآيَةَ { وَمَا مَنَعَنَآ أَن نُّرْسِلَ بِٱلْـَٔايَـٰتِ إِلَّآ أَن كَذَّبَ بِهَا ٱلْأَوَّلُونَ ۚ وَءَاتَيْنَا ثَمُودَ ٱلنَّاقَةَ مُبْصِرَةً }. واللفظ لأحمد."
    ]
  },
  {
    "surah": 17,
    "ayahs": [
      80
    ],
    "occasions": [
      "عَنِ ابْنِ عَبَّاسٍ رضي الله عنهما قَالَ: كَانَ النَّبِيُّ ﷺ بِمَكَّةَ، ثُمَّ أُمِرَ بِالْهِجْرَةِ، فَنَزَلَتْ عَلَيْهِ: { وَقُل رَّبِّ أَدْخِلْنِى مُدْخَلَ صِدْقٍ وَأَخْرِجْنِى مُخْرَجَ صِدْقٍ وَٱجْعَل لِّى مِن لَّدُنكَ سُلْطَـٰنًا نَّصِيرًا ﴿٨٠﴾ }. واللفظ للترمذي."
    ]
  },
  {
    "surah": 17,
    "ayahs": [
      85
    ],
    "occasions": [
      "عَنِ ابْنِ عَبَّاسٍ رضي الله عنهما قَالَ: قَالَتْ قُرَيْشٌ لِيَهُودَ: أَعْطُونَا شَيْئاً نَسْأَلُ هَذَا الرَّجُلَ، فَقَالَ: سَلُوهُ عَنِ الرُّوحِ، قَالَ: فَسَأَلُوهُ عَنِ الرُّوحِ، فَأَنْزَلَ اللهُ تَعَالَى { وَيَسْـَٔلُونَكَ عَنِ ٱلرُّوحِ ۖ قُلِ ٱلرُّوحُ مِنْ أَمْرِ رَبِّى وَمَآ أُوتِيتُم مِّنَ ٱلْعِلْمِ إِلَّا قَلِيلًا ﴿٨٥﴾ }، قَالُوا: أُوتِينَا عِلْماً كَثِيراً، أُوتِينَا التَّوْرَاةَ، وَمَنْ أُوتِيَ التَّوْرَاةَ فَقَدْ أُوتِيَ خَيْراً كَثِيراً، فَأُنْزِلَتْ: { قُل لَّوْ كَانَ ٱلْبَحْرُ مِدَادًا لِّكَلِمَـٰتِ رَبِّى لَنَفِدَ ٱلْبَحْرُ } إِلَى آخِرِ الآية. واللفظ للترمذي."
    ]
  },
  {
    "surah": 17,
    "ayahs": [
      110
    ],
    "occasions": [
      "عَنِ ابْنِ عَبَّاسٍ رضي الله عنهما فِي قَوْلِهِ عز و جل: { وَلَا تَجْهَرْ بِصَلَاتِكَ وَلَا تُخَافِتْ بِهَا } قَالَ: نَزَلَتْ وَرَسُولُ اللهِ ﷺ مُتَوَارٍ بِمَكَّةَ، فَكَانَ إِذَا صَلَّى بِأَصْحَابِهِ رَفَعَ صَوْتَهُ بِالْقُرْآنِ، فَإِذَا سَمِعَ ذَلِكَ الْمُشْرِكُونَ سَبُّوا الْقُرْآنَ، وَمَنْ أَنْزَلَهُ، وَمَنْ جَاءَ بِهِ، فَقَالَ اللهُ تَعَالَى لِنَبِيِّهِ ﷺ: { وَلَا تَجْهَرْ بِصَلَاتِكَ } فَيَسْمَعَ الْمُشْرِكُونَ قِرَاءَتَكَ، { وَلَا تُخَافِتْ بِهَا } عَنْ أَصْحَابِكَ، أَسْمِعْهُمْ الْقُرْآنَ، وَلَا تَجْهَرُ ذَلِكَ الْجَهْرَ، { وَٱبْتَغِ بَيْنَ ذَٰلِكَ سَبِيلًا }، يَقُولُ: بَيْنَ الْجَهْرِ وَالْمُخَافَتَةِ. واللفظ لمسلم.",
      "وللآية سبب ثان للنزول: فقد جاء عن ابن عباس رضي الله عنهما  قال: كان رسول الله ﷺ إذا جهر بالقرآن وهو يصلي، تفرقوا عنه وأبوا أن يسمعوا منه، فكان الرجل إذا أراد أن يسمع من رسول الله ﷺ بعض ما يتلو وهو يصلي، استرق السمع دونهم فرقاً منهم، فإذا رأى أنهم قد عرفوا أنه يستمع، ذهب خشية أذاهم فلم يسمع، فإن خفض صوته لم يسمع الذين يستمعون من قراءته شيئاً، فأنزل الله: { وَلَا تَجْهَرْ بِصَلَاتِكَ }، فيتفرقوا عنك، { وَلَا تُخَافِتْ بِهَا } فلا يسمع من أراد أن يسمع، ممن يسترق ذلك منهم، فلعله يرعوي إلى بعض ما يسمع فينتفع به، { وَٱبْتَغِ بَيْنَ ذَٰلِكَ سَبِيلًا }."
    ]
  }
]