[
  {
    "surah": 25,
    "ayahs": [
      27
    ],
    "occasions": [
      "عن ابن عباس رضي الله عنها: أن أبا معيط - هو عقبة بن أبي معيط -كان يجلس مع النبي ﷺ بمكة لا يؤذيه، وكان رجلاً حليماً، وكان بقية قريش إذا جلسوا معه آذوه، وكان لأبي معيط خليل غائب عنه بالشام، فقالت قريش صبأ أبو معيط، وقدم خليله من الشام ليلاً، فقال لامرأته: ما فعل محمد مما كان عليه؟ فقالت: أشد مما كان أمراً. فقال: ما فعل خليلي أبو معيط؟ فقالت: صبأ. فبات بليلة سوء، فلما أصبح أتاه أبو معيط فحياه، فلم يرد عليه التحية، فقال: ما لك لا ترد على تحيتي؟\n\nفقال: كيف أرد عليك تحيتك وقد صبوت؟ قال: أو قد فعلتها قريش؟ قال: نعم. قال: فما يبرئ صدورهم إن أنا فعلت؟ قال: تأتيه في مجلسه وتبصق في وجهه، وتشتمه بأخبث ما تعلمه من الشتم، ففعل، فلم يزد النبي ﷺ أن مسح وجهه من البصاق، ثم التفت إليه فقال: « إن وجدتك خارجاً من جبال مكة، أضرب عنقك صبراً ».\n\nفلما كان يوم بدر، وخرج أصحابه أبى أن يخرج، فقال له أصحابه: اخرج معنا، قال: قد وعدني هذا الرجل إن وجدني خارجاً من جبال مكة أن يضرب عنقي صبراً.\n\nفقالوا: لك جمل أحمر لا يدرك، فلو كانت الهزيمة طرت عليه. فخرج معهم، فلما هزم الله المشركين، وحل به جمله في جدد من الأرض، فأخذه رسول الله ﷺ أسيراً في سبعين من قريش، وقدم إليه أبو معيط فقال: تقتلني من بين هؤلاء؟ قال: « نعم، بما بصقت في وجهي » فأنزل الله في أبي معيط الآية."
    ]
  },
  {
    "surah": 25,
    "ayahs": [
      32
    ],
    "occasions": [
      "عن ابن عباس رضي الله عنهما قال: قال المشركون: لو كان محمد كما يزعم نبياً فلم يعذبه ربه؟ ألا ينزل عليه القرآن جملة واحدة؟ ينزل عليه الآية والآيتين، والسورة والسورتين فأنزل الله على نبيه جواب ما قالوا: { وَقَالَ ٱلَّذِينَ كَفَرُوا۟ لَوْلَا نُزِّلَ عَلَيْهِ ٱلْقُرْءَانُ جُمْلَةً وَٰحِدَةً ۚ كَذَٰلِكَ لِنُثَبِّتَ بِهِۦ فُؤَادَكَ ۖ وَرَتَّلْنَـٰهُ تَرْتِيلًا ﴿٣٢﴾ }."
    ]
  },
  {
    "surah": 25,
    "ayahs": [
      68
    ],
    "occasions": [
      "عن ابن عباس رضي الله عنهما قال: أن ناساً من أهل الشرك قتلوا فأكثروا، وزنوا فأكثروا، ثم أتوا محمداً ﷺ، فقالوا: إن الذي تقول وتدعو لحسن، ولو تخبرنا أن لما عملنا كفارة، فنزل: { وَٱلَّذِينَ لَا يَدْعُونَ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ وَلَا يَقْتُلُونَ ٱلنَّفْسَ ٱلَّتِى حَرَّمَ ٱللَّهُ إِلَّا بِٱلْحَقِّ وَلَا يَزْنُونَ ۚ وَمَن يَفْعَلْ ذَٰلِكَ يَلْقَ أَثَامًا ﴿٦٨﴾ } [الفرقان: ٦٨] { قُلْ يَـٰعِبَادِىَ ٱلَّذِينَ أَسْرَفُوا۟ عَلَىٰٓ أَنفُسِهِمْ لَا تَقْنَطُوا۟ مِن رَّحْمَةِ ٱللَّهِ ۚ إِنَّ ٱللَّهَ يَغْفِرُ ٱلذُّنُوبَ جَمِيعًا ۚ إِنَّهُۥ هُوَ ٱلْغَفُورُ ٱلرَّحِيمُ ﴿٥٣﴾ } [الزمر: ٥٣].",
      "وهناك سبب ثان لنزول الآية: فقد جاء عن عمرو بن شرحبيل قال: قال عبد الله رضي الله عنه: قال رجل: يا رسول الله أي الذنب أكبر عند الله؟ قال: « أن تدعو الله نداً وهو خلقك » قَالَ: ثُمَّ أَيُّ؟ قَالَ: « أَنْ تَقْتُل وَلَدَكَ مَخَافَةَ أَنْ يَطْعَمَ مَعَكَ »، قَالَ: ثُمَّ أَيُّ؟ قَالَ: « أَنْ تُزَانِي حَلِيلَةَ جَارِكَ »، فَأَنْزَلَ اللهُ عز و جل تَصْدِيقَهَا: { وَٱلَّذِينَ لَا يَدْعُونَ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ وَلَا يَقْتُلُونَ ٱلنَّفْسَ ٱلَّتِى حَرَّمَ ٱللَّهُ إِلَّا بِٱلْحَقِّ وَلَا يَزْنُونَ ۚ وَمَن يَفْعَلْ ذَٰلِكَ يَلْقَ أَثَامًا ﴿٦٨﴾ }."
    ]
  },
  {
    "surah": 25,
    "ayahs": [
      70
    ],
    "occasions": [
      "عَنْ سَعِيدِ بْنِ جُبَيْرٍ رحمه الله قَالَ: أَمَرَنِي عَبْدُ الرَّحْمَنِ بْنُ أَبْزَى قَالَ: سَلِ ابْنَ عَبَّاسِ رضي الله عنهما عَنْ هَاتَيْنِ الْآيَتَيْنِ، مَا أَمْرُهُمَا؟: { وَلَا تَقْتُلُوا۟ ٱلنَّفْسَ ٱلَّتِى حَرَّمَ ٱللَّهُ إِلَّا بِٱلْحَقِّ ۚ } [الأنعام: ١٥١] { وَمَن يَقْتُلْ مُؤْمِنًا مُّتَعَمِّدًا } [النساء: ٩٣].\n\nفَسَأَلْتُ ابْنَ عَبَّاسٍ فَقَالَ: لَمَّا أُنْزِلَتِ الَّتِي فِي الْفُرْقَانِ، قَالَ مُشْرِكُوا أَهْلِ مَكَّةَ: فَقَدْ قَتَلْنَا النَّفْسَ الَّتِي حَرَّمَ اللهُ، وَدَعَوْنَا مَعَ اللهِ إِلَهَاً آخَرَ، وَقَدْ أَتَيْنَا الْفَوَاحِشَ، فَأَنْزَلَ اللهُ: { إِلَّا مَن تَابَ وَءَامَنَ } الآية."
    ]
  }
]