[
  {
    "surah": 48,
    "ayahs": [
      1
    ],
    "occasions": [
      "عَنْ عَبْدِ اللهِ بْنِ مَسْعُودٍ رضي الله عنه قَالَ: لَمَّا انْصَرَفْنَا مِنْ غَزْوَةِ الْحُدَيْبِيَةِ، قَالَ رَسُولُ اللهِ ﷺ: « مَنْ يَحْرُسُنَا اللَّيْلَةَ »؟ قَالَ عَبْدُ اللهِ: فَقُلْتُ: أَنَا. حَتَّى عَادَ مِرَاراً، قُلْتُ: أَنَا يَا رَسُولَ اللهِ. قَالَ: « فَأَنْتَ إِذَاً »، قَالَ: فَحَرَسْتُهُمْ، حَتَّى إِذَا كَانَ وَجْهُ الصُّبْحِ، أَدْرَكَنِي قَوْلُ رَسُولِ اللهِ ﷺ: « إِنَّكَ تَنَامُ »، فَنِمْتُ، فَمَا أَيْقَظَنَا إِلَّا حَرُّ الشَّمْسِ فِي ظُهُورِنَا، فَقَامَ رَسُولُ اللهِ ﷺ، وَصَنَعَ كَمَا كَانَ يَصْنَعُ مِنْ الْوُضُوءِ، وَرَكْعَتَيْ الْفَجْرِ ثُمَّ صَلَّى بِنَا الصُّبْحَ، فَلَمَّا انْصَرَفَ، قَالَ: « إِنَّ اللهَ عز و جل، لَوْ أَرَادَ أَنْ لَا تَنَامُوا لَمْ تَنَامُوا، وَلَكِنْ أَرَادَ أَنْ تَكُونُوا لِمَنْ بَعْدَكُمْ، فَهَكَذَا لِمَنْ نَامَ أَوْ نَسِيَ ».\n\nقَالَ: ثُمَّ إِنَّ نَاقَةَ رَسُولِ اللهِ ﷺ وَإِبِلَ الْقَوْمِ تَفَرَّقَتْ، فَخَرَجَ النَّاسُ فِي طَلَبِهَا، فَجَاءُوا بِإِبْلِهِمْ، إِلَّا نَاقَةَ رَسُولِ اللهِ ﷺ، فَقَالَ عَبْدُ اللهِ: قَالَ لِي رَسُولُ اللهِ ﷺ: « خُذْ هَهُنَا »، فَأَخَذْتُ حَيْثُ قَالَ لِي، فَوَجَدْتُ زِمَامَهَا قَدْ الْتَوَى عَلَى شَجَرَةٍ، مَا كَانَتْ لِتَحُلَّهَا إِلَّا يَدٌ، قَالَ: فَجِئْتُ بِهَا النَّبِيَّ ﷺ، فَقُلْتُ: يَا رَسُولَ اللهِ، وَالَّذِي بَعَثَكَ بِالْحَقِّ نَبِيًّا لَقَدْ وَجَدْتُ زِمَامَهَا مُلْتَوِياً عَلَى شَجَرَةٍ مَا كَانَتْ لِتَحُلَّهَا إِلَّا يَدٌ، قَالَ: وَنَزَلَتْ عَلَى رَسُولِ اللهِ ﷺ، سُورَةُ الْفَتْحِ: { إِنَّا فَتَحْنَا لَكَ فَتْحًا مُّبِينًا ﴿١﴾ }. واللفظ لأحمد."
    ]
  },
  {
    "surah": 48,
    "ayahs": [
      24
    ],
    "occasions": [
      "عَنْ أَنَسٍ رضي الله عنه أَنَّ ثَمَانِينَ رَجُلًا مِنْ أَهْلِ مَكَّةَ، هَبَطُوا عَلَى رَسُولِ اللهِ ﷺ وَأَصْحَابِهِ مِنْ جَبَلِ التَّنْعِيمِ، عِنْدَ صَلَاةِ الْفَجْرِ، فَأَخَذَهُمْ رَسُولُ اللهِ ﷺ سِلْماً، فَعَفَا عَنْهُمْ، وَنَزَلَ الْقُرْآنُ: { وَهُوَ ٱلَّذِى كَفَّ أَيْدِيَهُمْ عَنكُمْ وَأَيْدِيَكُمْ عَنْهُم بِبَطْنِ مَكَّةَ مِنۢ بَعْدِ أَنْ أَظْفَرَكُمْ عَلَيْهِمْ ۚ }. واللفظ لأحمد."
    ]
  }
]