[
  {
    "surah": 58,
    "ayahs": [
      1,
      2
    ],
    "occasions": [
      "عَنْ عَائِشَةُ رضي الله عنها قَالَتْ: تَبَارَكَ الَّذِي وَسِعَ سَمْعُهُ كُلَّ شَيْءٍ، إِنِّي لَأَسْمَعُ كَلَامَ خَوْلَةَ بِنْتِ ثَعْلَبَةَ، وَيَخْفَى عَلَيَّ بَعْضُهُ، وَهِيَ تَشْتَكِي زَوْجَهَا إِلَى رَسُولِ اللهِ ﷺ، وَهِيَ تَقُولُ: يَا رَسُولَ اللهِ، أَكَلَ شَبَابِي، وَنَثَرْتُ لَهُ بَطْنِي، حَتَّى إِذَا كَبِرَتْ سِنِّي، وَانْقَطَعَ وَلَدِي، ظَاهَرَ مِنِّي، اللَّهُمَّ إِنِّي أَشْكُو إِلَيْكَ.\n\nفَمَا بَرِحَتْ حَتَّى نَزَلَ جِبْرَائِيلُ بِهَؤُلَاءِ الْآيَاتِ: { قَدْ سَمِعَ ٱللَّهُ قَوْلَ ٱلَّتِى تُجَـٰدِلُكَ فِى زَوْجِهَا وَتَشْتَكِىٓ إِلَى ٱللَّهِ }. واللفظ لابن ماجه في الطلاق.",
      "عَنْ خَوْلَةَ بِنْتِ ثَعْلَبَةَ رضي الله عنها قَالَتْ: وَاللهِ فِيَّ وَفِي أَوْسِ بْنِ صامِتٍ أَنْزَلَ اللهُ عز و جل صَدْرَ سُورَةِ الْمُجَادَلَةِ، قَالَتْ: كُنْتُ عِنْدَهُ وَكَانَ شَيْخاً كَبِيراً قَدْ سَاءَ خُلُقُهُ وَضَجِرَ، قَالَتْ: فَدَخَلَ عَلَيَّ يَوْماً فَرَاجَعْتُهُ بِشَيْءٍ، فَغَضِبَ فَقَالَ: أَنْتِ عَلَيَّ كَظَهْرِ أُمِّي، قَالَتْ: ثُمَّ خَرَجَ فَجَلَسَ فِي نَادي قَوْمِهِ سَاعَةً ثُمَّ دَخَلَ عَلَيَّ، فَإِذَا هُوَ يُرِيدُنِي عَلَى نَفْسِي قَالَتْ: فَقُلْتُ: كَلَّا وَالَّذِي نَفْسُ خُوَيْلَةَ بِيدَهِ لَا تَخْلُصُ إِلَيَّ، وَقَدْ قُلْتَ مَا قُلْتَ حَتَّى يَحْكُمَ اللهُ وَرَسُولُهُ فِينَا بِحُكْمِهِ، قَالَتْ: فَوَاثَبَنِي وَامْتَنَعْتُ مِنْهُ فَغَلَبْتُهُ بِمَا تَغْلِبُ بِهِ الْمَرْأَةُ الشَّيْخَ الضَّعِيفَ، فَأَلْقَيْتُهُ عنِّي، قَالَتْ: ثُمَّ خَرَجْتُ إِلَى بَعْضِ جَارَاتِي فَاسْتَعَرْتُ مِنْهَا ثِيَابَهَا، ثُمَّ خَرَجْتُ حَتَّى جِئْتُ رَسُولَ اللهِ ﷺ فَجَلَسْتُ بَيْنَ يَدَيْهِ فَذَكَرْتُ لَهُ مَا لَقِيتُ مِنْهُ، فَجَعَلْتُ أَشْكُو إِلَيْهِ ﷺ مَا أَلْقَى مِنْ سُوءِ خُلُقِهِ، قَالَتْ: فَجَعَلَ رَسُولُ اللهِ يَقُولُ: « يَا خُوَيْلَةُ ابْنُ عَمْكِ شَيْخٌ كَبِيرٌ فَاتَّقِي اللهَ فِيهِ »، قَالَتْ: فَوَاللهِ مَا بَرِحْتُ حَتَّى نَزَلَ فِيَّ الْقُرْآنُ، فَتَغَشَّى رَسُولُ اللهِ ﷺ مَا كَانَ يَتَغَشَّاهُ ثُمَّ سُرِّيَ عَنْهُ، فَقَالَ لِي: « يَا خُوَيْلَةُ قَدْ أَنْزَلَ اللهُ فِيكِ وَفِي صَاحِبِكِ »، ثُمَّ قَرَأَ عَلَيَّ: { قَدْ سَمِعَ ٱللَّهُ قَوْلَ ٱلَّتِى تُجَـٰدِلُكَ فِى زَوْجِهَا وَتَشْتَكِىٓ إِلَى ٱللَّهِ وَٱللَّهُ يَسْمَعُ تَحَاوُرَكُمَآ ۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٌ ﴿١﴾ } إِلَى قَوْلِهِ { وَلِلْكَـٰفِرِينَ عَذَابٌ أَلِيمٌ }، فَقَالَ لِي رَسُولُ اللهِ ﷺ: « مُرِيهِ فَلْيُعْتِقْ رَقَبَةً »، قَالَتْ: فَقُلْتُ: وَاللهِ يَا رَسُولَ اللهِ مَا عِنْدَهُ مَا يُعْتِقُ، قَالَ: « فَلْيَصُمْ شَهْرَيْنِ مُتَتَابِعَيْنِ »، قَالَتْ: فَقُلْتُ: وَاللهِ يَا رَسُولَ اللهِ إِنَّهُ شَيْخٌ كَبِيرٌ مَا بِهِ مِنْ صِيَامٍ، قَالَ: « فَلْيُطْعِم سِتِّينَ مِسْكِيناً وَسْقاً مِنْ تَمْرٍ »، قَالَتْ: قُلْتُ: وَاللهِ يَا رَسُولَ اللهِ مَا ذَاكَ عِنْدَهُ، قَالَتْ: فَقَالَ رَسُولُ اللهِ ﷺ: « فَإِنَّا سَنُعِيتُهُ بِعَرَقٍ مِنْ تَمْرٍ »، قَالَتْ: فَقُلْتُ: وَأَنَا يَا رَسُولَ اللهِ سَأُعِينُهُ بِعَرَقٍ آخَرَ، قَالَ: « قَدْ أَصَبْتِ وَأَحْسَنْتِ فَاذْهَبِي فَتَصَدَّقِي عَنْهُ، ثُمَّ اسْتَوْصِي بِابْنِ عَمَِكِ خَيْراً » قَالَتْ: فَفَعَلْتُ. قَالَ سَعْدٌ: الْعَرَقُ الصَّنُّ. واللفظ لأحمد."
    ]
  },
  {
    "surah": 58,
    "ayahs": [
      8
    ],
    "occasions": [
      "عَنْ أَنَسِ بْنِ مَالِكٍ رضي الله عنه أَنَّ يَهُودِيَّا أَتَى عَلَى النَّبِيِّ ﷺ وَأَصْحَابِهِ، فَقَالَ: السَّامُ عَلَيْكُمْ، فَرَدَّ عَلَيْهِ الْقَوْمُ، فَقَالَ نَبِيُّ اللهَ ﷺ: « هَلْ تَدْرُونَ مَا قَالَ هَذَا؟ » قَالُوا: اللهُ وَرَسُولُهُ أَعْلَمُ، سَلَّمَ يَا نَبِيَّ اللهِ. قَالَ: « لاَ، وَلَكِنَّهُ قَالَ كَذَا وَكَذَا، رُدُّوهُ عَلَيَّ »، فَرَدُّوهُ. قَالَ: « قُلْتَ: السَّامُّ عَلَيْكُمْ » قَالَ: نَعَمْ، قَالَ نَبِيُّ اللهِ ﷺ عِنْدَ ذَلِكَ: « إِذَا سَلَّمَ عَلَيْكُمْ أَحَدٌ مِنْ أَهْلِ الْكِتَابِ فَقُولُوا: عَلَيْكَ مَا قُلْتَ ». قَالَ: { وَإِذَا جَآءُوكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ ٱللَّهُ }. واللفظ للترمذي.",
      "عَنْ عَائِشَةَ رضي الله عنها قَالَتْ: أَتَى النَّبِيَّ ﷺ نَاسٌ مِنْ الْيَهُودِ، فَقَالُوا: السَّامُ عَلَيْكَ، يَا أَبَا الْقَاسِمِ، فَقَالَ: « وَعَلْيْكُمْ »، قَالَتْ عَائِشَةُ: فَقُلْتُ: وَعَلَيْكُمْ السَّامُ وَالَّذامُ، فَقَالَ رَسُولُ الله ﷺ: «يَا عَائِشَةُ لَا تَكُونِي فَاحِشَةً». قَالَتْ: فَقُلْتُ: يَا رَسُولَ اللهِ أَمَا سَمِعْتَ مَا قَالُوا: السَّامُ عَلَيْكَ؟!!، قَالَ: « أَلَيْسَ قَدْ رَدَدْتُ عَلَيْهِمْ الَّذِي قَالُوا؛ قُلْتُ: وَعَلَيْكُمْ ».\n\nقَالَ ابْنُ نُمَيْرٍ - يَعْنِي فِي حَدِيثِ عَائِشَةَ -، إِنَّ اللهَ عز و جل لَا يُحِبُّ الْفُحْشَ وَلَا التَّفَحُّشَ، وَقَالَ ابْنُ نُمَيْرٍ فِي حَدِيثِهِ فَنَزَلَتْ هَذِهِ الْآيَةُ: { وَإِذَا جَآءُوكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ ٱللَّهُ } حَتَّى فَرَغَ."
    ]
  },
  {
    "surah": 58,
    "ayahs": [
      12
    ],
    "occasions": [
      "عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رضي الله عنه: قَالَ لَمَّا نَزَلَتْ { يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا نَـٰجَيْتُمُ ٱلرَّسُولَ فَقَدِّمُوا۟ بَيْنَ يَدَىْ نَجْوَىٰكُمْ صَدَقَةً ۚ } قَالَ لِي النَّبِيُّ ﷺ: « مَا تَرَى دِينَاراً »، قُلْتُ: لَا يُطِيقُونَهُ، قَالَ: فَنِصْفُ دِينَارٍ»، قُلْتُ: لَا يُطِيقُونَهُ، قَالَ: « فَكَمْ » قُلْتُ: شَعِيرَةٌ، قَالَ: « إِنَّكَ لَزَهِيدٌ » قَالَ: فَنَزَلَتْ: { ءَأَشْفَقْتُمْ أَن تُقَدِّمُوا۟ بَيْنَ يَدَىْ نَجْوَىٰكُمْ صَدَقَـٰتٍۢ ۚ } الْآيَةَ قَالَ: فَبِي خَفَّفَ اللهُ عَنْ هَذِهِ الْأُمَّةِ. واللفظ للترمذي."
    ]
  }
]