[
  {
    "surah": 60,
    "ayahs": [
      1
    ],
    "occasions": [
      "عَنْ عَلِيٍّ رضي الله عنه قَالَ: بَعَثَنَا رَسُولُ اللهِ ﷺ أَنَا وَالزُّبَيْرَ وَالْمِقْدَادَ، فَقَالَ: « ائْتُوا رَوْضَةَ خَاخٍ، فَإِنَّ بِهَا ظَعِينَةً مَعَهَا كِتَابٌ، فَخُذُوهُ مِنْهَا »، فَانْطَلَقْنَا تَعَادَى بِنَا خَيْلُنَا، فَإِذَا نَحْنُ بِالْمَرْأَةِ، فَقُلْنَا: أَخْرِجِي الْكِتَابَ. فَقَالَتْ: مَا مَعِي كِتَابٌ. فَقُلْنَا: لَتُخْرِجِنَّ الْكِتَابَ أَوْ لَنُلْقِيَنَّ الثِّيَابَ، فَأَخْرَجَتْهُ مِنْ عِقَاصِهَا، فَأَتَيْنَا بِهِ رَسُولَ اللهِ ﷺ، فَإِذَا فِيهِ: مِنْ حَاطِبِ بْنِ أَبِي بَلْتَعَةَ إِلَى نَاسٍ مِنْ الْمُشْرِكِينَ، مِنْ أَهْلِ مَكَّةَ، يُخْبِرُهُمْ بِبَعْضِ أَمْرِ رَسُولِ اللهِ ﷺ، فَقَالَ رَسُولُ اللهِ ﷺ: « يَا حَاطِبُ! مَا هَذَا؟ » قَالَ: لَا تَعْجَلْ عَلَيَّ يَا رَسُولَ اللهِ، إِنِّي كُنْتُ امْرَأً مُلْصَقاً فِي قُرَيْشٍ - قَالَ سُفْيَانُ: كَانَ حَلِيفَاً لَهُمْ، وَلَمْ يَكُنْ مِنْ أَنْفُسِهَا -، وَكَانَ مِمَّنْ كَانَ مَعَكَ مِنْ الْمُهَاجِرِينَ، لَهُمْ قَرَابَاتٌ يَحْمُونَ بِهَا أَهْلِيهِمْ، فَأَحْبَبْتُ، إِذْ فَاتَنِي ذَلِكَ مِنْ النَّسَبِ فِيهِمْ، أَنْ أَتَّخِذَ فِيهِمْ يَداً يَحْمُونَ بِهَا قَرَابَتِي، وَلَمْ أَفْعَلْهُ كُفْراً، وَلَا ارْتِدَاداً عَنْ دِينِي، وَلَا رِضا بِالْكُفْرِ بَعْدَ الْإِسْلَامِ، فَقَالَ النَّبِيُّ ﷺ: « صَدَقَ »، فَقَالَ عُمَرُ: دَعْنِي يَا رَسُولَ اللهِ، أَضْرِبْ عُنُقَ هَذَا الْمُنَافِقِ. فَقَالَ: « إِنَّهُ قَدْ شَهِدَ بَدْراً، وَمَا يُدْرِيكَ لَعَلَّ اللهَ اطَّلَعَ عَلَى أَهْلِ بَدْرٍ، فَقَالَ: اعْمَلُوا مَا شِئْتُمْ، فَقَدْ غَفَرْتُ لَكُمْ ». فَأَنْزَلَ اللهُ عز و جل: { يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ لَا تَتَّخِذُوا۟ عَدُوِّى وَعَدُوَّكُمْ أَوْلِيَآءَ }. واللفظ لمسلم."
    ]
  },
  {
    "surah": 60,
    "ayahs": [
      8
    ],
    "occasions": [
      "عَنْ عَبْدِ اللهِ بْنِ الزُّبَيْرِ رضي الله عنهما قَالَ: قَدِمَتْ قُتَيْلَةُ ابْنَةُ عَبْدِ الْعُزَّى بْنِ عَبْدِ أَسْعَدَ مِنْ بَنِي مَالِكِ بْنِ حَسَلٍ عَلَى ابْنَتِهَا أَسْمَاءَ ابْنَةِ أَبِي بَكْرٍ بِهَدَايَا، ضِبَابٍ وَأَقِطٍ وَسَمْنٍ، وَهِيَ مُشْرِكَةٌ، فَأَبَتْ أَسْمَاءُ أَنْ تَقْبَلَ هَدِيَّتَهَا وَتُدْخِلَهَا بَيْتَهَا، فَسَأَلَتْ عَائِشَةُ النَّبِيَّ ﷺ، فَأَنْزَلَ اللهُ عز و جل: { لَّا يَنْهَىٰكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ لَمْ يُقَـٰتِلُوكُمْ فِى ٱلدِّينِ } إِلَى آخِرِ الْآيَةِ، فَأَمَرَهَا أَنْ تَقْبَلَ هَدِيَّتَهَا، وَأَنْ تُدْخِلَهَا بَيْتَهَا. واللفظ لأحمد."
    ]
  },
  {
    "surah": 60,
    "ayahs": [
      10
    ],
    "occasions": [
      "عَنْ مَرْوَانَ وَالْمِسْوَرَ بْنَ مَخْرَمَةَ رضي الله عنهما يُخْبِرَانِ عَنْ أَصْحَابِ رَسُولِ اللهِ ﷺ قَالَ: لَمَّا كَاتَبَ سُهَيْلُ بْنُ عَمْرٍو يَوْمَئِذٍ، كَانَ فِيمَا اشْتَرَطَ سُهَيْلُ بْنُ عَمْرٍو عَلَى النَّبِيِّ ﷺ، أَنَّهُ لَا يَأْتِيكَ مِنَّا أَحَدٌ، وَإِنْ كَانَ عَلَى دِينِكَ إِلَّا رَدَدْتَهُ إِلَيْنَا، وَخَلَّيْتَ بَيْنَنَا وَبَيْنَهُ، فَكَرِهَ الْمُؤْمِنُونَ ذَلِكَ وَامْتَعَضُوا مِنْهُ، وَأَبَى سُهَيْلٌ إِلَّا ذَلِكَ، فَكَاتَبَهُ النَّبِيُّ ﷺ عَلَى ذَلِكَ، فَرَدَّ يَوْمَئِذٍ أَبَا جَنْدَلٍ إِلَى أَبِيهِ سُهَيْلِ بْنِ عَمْرٍو، وَلَمْ يَأْتِهِ أَحَدٌ مِنْ الرِّجَالِ إِلَّا رَدَّهُ فِي تِلْكَ الْمُدَّةِ، وَإِنْ كَانَ مُسْلِماً، وَجَاءَتِ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ، وَكَانَتْ أُمُّ كُلْثُومٍ بِنْتُ عُقْبَةَ بْنِ أَبِي مُعَيْطٍ مِمَّنْ خَرَجَ إِلَى رَسُولِ يَوْمَئِذٍ وَهِيَ عَاتِقٌ، فَجَاءَ أَهْلُهَا يَسْأَلُونَ النَّبِيَّ ﷺ أَنْ يَرْجِعَهَا إِلَيْهِمْ، لِمَا أَنْزَلَ اللهُ فِيهِنَّ: { إِذَا جَآءَكُمُ ٱلْمُؤْمِنَـٰتُ مُهَـٰجِرَٰتٍۢ فَٱمْتَحِنُوهُنَّ ۖ ٱللَّهُ أَعْلَمُ بِإِيمَـٰنِهِنَّ ۖ } إِلَى قَوْلِهِ { وَلَا هُمْ يَحِلُّونَ لَهُنَّ ۖ }، قَالَ عُرْوَةُ: فَأَخْبَرَتْنِي عَائِشَةُ أَنَّ رَسُولَ اللهِ ﷺ كَانَ يَمْتَحِنُهُنَّ بِهَذِهِ الْآيَةِ: { يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓا۟ إِذَا جَآءَكُمُ ٱلْمُؤْمِنَـٰتُ مُهَـٰجِرَٰتٍۢ فَٱمْتَحِنُوهُنَّ ۖ } إِلَى { غَفُورٌ رَّحِيمٌ }، قَالَ عُرْوَةُ: قَالَتْ عَائِشَةُ: فَمَنْ أَقَرَّ بِهَذَا الشَّرْطِ مِنْهُنَّ قَالَ لَهَا رَسُول اللهِ ﷺ: « قَدْ بَايَعْتُكِ »، كَلَاماً يُكَلِّمُهَا بِهِ، وَاللهِ مَا مَسَّتْ يَدُهُ يَدَ امْرَأَةٍ قَطُّ فِي الْمُبَايَعَةِ وَمَا بَايَعَهُنَّ إِلَّا بِقَوْلِهِ. واللفظ للبخاري."
    ]
  }
]